app/controllers/bookings_controller.rb

  def index
    @bookings = current_user.bookings.includes(:room).paginate(page: params[:page], per_page: 10)
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 4], ["LIMIT", 10], ["OFFSET", 0]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" IN ($1, $2)  [["id", 1], ["id", 36]]

  def create
    @booking = current_user.bookings.build(booking_params)
    respond_to do |format|
      if @booking.save
---
INSERT INTO "bookings" ("room_type", "user_id", "room_id", "start_date", "last_date", "cost", "created_at", "updated_at", "number_of_person") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def set_booking
      @booking = current_user.bookings.find_by_id(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND "bookings"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]