app/controllers/rooms_controller.rb

SELECT COUNT(*) FROM "rooms" WHERE (room_type = 0 AND id NOT IN (36))
---
  def check_availability
    @errors = []
    if check_date_range(params[:check_in], params[:check_out])
      return false
    elsif params[:room_type].empty?
      @deluxe = Room.available_rooms(params[:check_in], params[:check_out], 'Deluxe Rooms').count